app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    @links = Link.all

INSERT INTO "links" ("title", "string", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "links me"], ["string", "hello"], ["url", "help.com"], ["created_at", 2016-07-21 21:40:26 UTC], ["updated_at", 2016-07-21 21:40:26 UTC], ["user_id", 2]]
---
  def create
    @link = current_user.link.build(link_params)

    respond_to do |format|
      if @link.save

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_link
      @link = Link.find(params[:id])